Tekla Open API Reference for Tekla Structures 2025
AnalysisResultPositions.GetResultPositions Method
 Gets the analysis result positions.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetResultPositions()
Public Function GetResultPositions As Boolean
Return Value
Type: Boolean
True if successfully got the analysis result positions.
See Also
Reference
AnalysisResultPositions Class
Tekla.Structures.Analysis Namespace